Benchmarks/media-streaming_multiple_clients/parser_output/output_run_2/result4.log

Total: connections 440 requests 7453 replies 7453 test-duration 330.229 s
Number of connected connections is currently = 0

Connection rate: 1.3 conn/s (750.5 ms/conn, <=440 concurrent connections)
Connected connection rate: 1.3 conn/s (750.5 ms/conn, <=440 concurrent connected connections)
Connection time [ms]: min 30012.0 avg 129486.7 max 320578.0 median 99999.5 stddev 101297.5
Connection time [ms]: connect 0.1
Connection length [replies/conn]: 16.939

Response time (no timeouts) [ms]: 0.0
Response time (only timeouts) [ms]: 0.0
Response time (all) [ms]: 129486.7
Request rate: 22.6 req/s (44.3 ms/req)
Request size [B]: 139.0

Overall reply rate: 22.6 replies/sec
Reply rate [replies/s]: min 8.6 avg 22.6 max 176.0 stddev 29.9 (66 samples)
Reply time [ms]: response 1.3 transfer 4.0
Reply size [B]: header 294.0 content 3022851.0 footer 0.0 (total 3023145.0)
Reply status: 1xx=0 2xx=7453 3xx=0 4xx=0 5xx=0

CPU time [s]: user 1.74 system 26.19 (user 0.5% system 7.9% total 8.5%)
Net I/O: 66633.8 KB/s (545.9*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 addrinuse 0 other 0
Unconnected timeouts 0 connected timeouts 0 total (0) client_timeouts 0


Session rate [sess/s]: min 0.00 avg 1.33 max 9.00 stddev 3.16 (440/440)
Session: avg 1.00 connections/session
Session lifetime [s]: 129.5
Session failtime [s]: 0.0
Session length histogram: 0 0 0 0 0 0 0 90 0 0 86 0 0 0 0 89 0 88 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 87